Tekla Open API Reference for Tekla Structures 2025
Angle.ToString Method
Overload List
Name | Description
ToString()
 Converts the represented angle to a string in the current units
 (Overrides Object.ToString().)
ToString(Angle.UnitType)
 Converts the represented angle to a string in the given units
ToString(String, IFormatProvider)
 Converts the represented angle to a string with the given parameters
ToString(String, IFormatProvider, Angle.UnitType)
 Converts the represented angle to a string with the given parameters
Top
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace